БылковДА_70180166/src/Documents/ВедомостьОСистемеАкадемическихЗадолженностейДляСтудентовсИОМ/ВедомостьОСистемеАкадемическихЗадолженностейДляСтудентовсИОМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьОСистемеАкадемическихЗадолженностейДляСтудентовсИОМ</name>
  <basedOn>Document.ИндивидуальныйПланЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатЗаседанияКомиссии</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтроля</name>
      <type>
        <types>EnumRef.НаименованиеКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>EnumRef.Оценка</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкадемическойЗадолженности</name>
      <type>
        <types>EnumRef.НаименованиеСтатуса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БылковДА_70180166/src/Documents/ВедомостьОСистемеАкадемическихЗадолженностей/ВедомостьОСистемеАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьОСистемеАкадемическихЗадолженностей</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Documents/ВедомостьОСистемеАкадемическихЗадолженностейДляСтудентовсИОМ/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ВедомостьОСистемеАкадемическихЗадолженностей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Дата,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Дисциплина,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.НаименованиеКонтроля,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Номер,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Оценка,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Преподаватель,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.СтатусАкадемическойЗадолженности,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Студент
	|ИЗ
	|	Документ.ВедомостьОСистемеАкадемическихЗадолженностей КАК ВедомостьОСистемеАкадемическихЗадолженностей
	|ГДЕ
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
